GopalSaraf/Practicals/PSDL/include/proc/pic18f45j11.inc
// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0FB6h
// bitfield definitions
CCPR2H_CCPR2H_POSN                       equ 0000h
CCPR2H_CCPR2H_POSITION                   equ 0000h
CCPR2H_CCPR2H_SIZE                       equ 0008h
CCPR2H_CCPR2H_LENGTH                     equ 0008h
CCPR2H_CCPR2H_MASK                       equ 00FFh

// Register: ECCP2DEL
#define ECCP2DEL ECCP2DEL
ECCP2DEL                                 equ 0FB7h
// bitfield definitions
ECCP2DEL_P2DC_POSN                       equ 0000h
ECCP2DEL_P2DC_POSITION                   equ 0000h
ECCP2DEL_P2DC_SIZE                       equ 0007h
ECCP2DEL_P2DC_LENGTH                     equ 0007h
ECCP2DEL_P2DC_MASK                       equ 007Fh
ECCP2DEL_P2RSEN_POSN                     equ 0007h
ECCP2DEL_P2RSEN_POSITION                 equ 0007h
ECCP2DEL_P2RSEN_SIZE                     equ 0001h
ECCP2DEL_P2RSEN_LENGTH                   equ 0001h
ECCP2DEL_P2RSEN_MASK                     equ 0080h
ECCP2DEL_P2DC0_POSN                      equ 0000h
ECCP2DEL_P2DC0_POSITION                  equ 0000h
ECCP2DEL_P2DC0_SIZE                      equ 0001h
ECCP2DEL_P2DC0_LENGTH                    equ 0001h
ECCP2DEL_P2DC0_MASK                      equ 0001h
ECCP2DEL_P2DC1_POSN                      equ 0001h
ECCP2DEL_P2DC1_POSITION                  equ 0001h
ECCP2DEL_P2DC1_SIZE                      equ 0001h
ECCP2DEL_P2DC1_LENGTH                    equ 0001h
ECCP2DEL_P2DC1_MASK                      equ 0002h
ECCP2DEL_P2DC2_POSN                      equ 0002h
ECCP2DEL_P2DC2_POSITION                  equ 0002h
ECCP2DEL_P2DC2_SIZE                      equ 0001h
ECCP2DEL_P2DC2_LENGTH                    equ 0001h
ECCP2DEL_P2DC2_MASK                      equ 0004h
ECCP2DEL_P2DC3_POSN                      equ 0003h
ECCP2DEL_P2DC3_POSITION                  equ 0003h
ECCP2DEL_P2DC3_SIZE                      equ 0001h
ECCP2DEL_P2DC3_LENGTH                    equ 0001h
ECCP2DEL_P2DC3_MASK                      equ 0008h
ECCP2DEL_P2DC4_POSN                      equ 0004h
ECCP2DEL_P2DC4_POSITION                  equ 0004h
ECCP2DEL_P2DC4_SIZE                      equ 0001h
ECCP2DEL_P2DC4_LENGTH                    equ 0001h
ECCP2DEL_P2DC4_MASK                      equ 0010h
ECCP2DEL_P2DC5_POSN                      equ 0005h
ECCP2DEL_P2DC5_POSITION                  equ 0005h
ECCP2DEL_P2DC5_SIZE                      equ 0001h
ECCP2DEL_P2DC5_LENGTH                    equ 0001h
ECCP2DEL_P2DC5_MASK                      equ 0020h
ECCP2DEL_P2DC6_POSN                      equ 0006h
ECCP2DEL_P2DC6_POSITION                  equ 0006h
ECCP2DEL_P2DC6_SIZE                      equ 0001h
ECCP2DEL_P2DC6_LENGTH                    equ 0001h
ECCP2DEL_P2DC6_MASK                      equ 0040h

// Register: ECCP2AS
#define ECCP2AS ECCP2AS
ECCP2AS                                  equ 0FB8h
// bitfield definitions
ECCP2AS_PSS2BD_POSN                      equ 0000h
ECCP2AS_PSS2BD_POSITION                  equ 0000h
ECCP2AS_PSS2BD_SIZE                      equ 0002h
ECCP2AS_PSS2BD_LENGTH                    equ 0002h
ECCP2AS_PSS2BD_MASK                      equ 0003h
ECCP2AS_PSS2AC_POSN                      equ 0002h
ECCP2AS_PSS2AC_POSITION                  equ 0002h
ECCP2AS_PSS2AC_SIZE                      equ 0002h
ECCP2AS_PSS2AC_LENGTH                    equ 0002h
ECCP2AS_PSS2AC_MASK                      equ 000Ch
ECCP2AS_ECCP2AS_POSN                     equ 0004h
ECCP2AS_ECCP2AS_POSITION                 equ 0004h
ECCP2AS_ECCP2AS_SIZE                     equ 0003h
ECCP2AS_ECCP2AS_LENGTH                   equ 0003h
ECCP2AS_ECCP2AS_MASK                     equ 0070h
ECCP2AS_ECCP2ASE_POSN                    equ 0007h
ECCP2AS_ECCP2ASE_POSITION                equ 0007h
ECCP2AS_ECCP2ASE_SIZE                    equ 0001h
ECCP2AS_ECCP2ASE_LENGTH                  equ 0001h
ECCP2AS_ECCP2ASE_MASK                    equ 0080h
ECCP2AS_PSS2BD0_POSN                     equ 0000h
ECCP2AS_PSS2BD0_POSITION                 equ 0000h
ECCP2AS_PSS2BD0_SIZE                     equ 0001h
ECCP2AS_PSS2BD0_LENGTH                   equ 0001h
ECCP2AS_PSS2BD0_MASK                     equ 0001h
ECCP2AS_PSS2BD1_POSN                     equ 0001h
ECCP2AS_PSS2BD1_POSITION                 equ 0001h
ECCP2AS_PSS2BD1_SIZE                     equ 0001h
ECCP2AS_PSS2BD1_LENGTH                   equ 0001h
ECCP2AS_PSS2BD1_MASK                     equ 0002h
ECCP2AS_PSS2AC0_POSN                     equ 0002h
ECCP2AS_PSS2AC0_POSITION                 equ 0002h
ECCP2AS_PSS2AC0_SIZE                     equ 0001h
ECCP2AS_PSS2AC0_LENGTH                   equ 0001h
ECCP2AS_PSS2AC0_MASK                     equ 0004h
ECCP2AS_PSS2AC1_POSN                     equ 0003h
ECCP2AS_PSS2AC1_POSITION                 equ 0003h
ECCP2AS_PSS2AC1_SIZE                     equ 0001h
ECCP2AS_PSS2AC1_LENGTH                   equ 0001h
ECCP2AS_PSS2AC1_MASK                     equ 0008h
ECCP2AS_ECCP2AS0_POSN                    equ 0004h
ECCP2AS_ECCP2AS0_POSITION                equ 0004h
ECCP2AS_ECCP2AS0_SIZE                    equ 0001h
ECCP2AS_ECCP2AS0_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS0_MASK                    equ 0010h
ECCP2AS_ECCP2AS1_POSN                    equ 0005h
ECCP2AS_ECCP2AS1_POSITION                equ 0005h
ECCP2AS_ECCP2AS1_SIZE                    equ 0001h
ECCP2AS_ECCP2AS1_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS1_MASK                    equ 0020h
ECCP2AS_ECCP2AS2_POSN                    equ 0006h
ECCP2AS_ECCP2AS2_POSITION                equ 0006h
ECCP2AS_ECCP2AS2_SIZE                    equ 0001h
ECCP2AS_ECCP2AS2_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS2_MASK                    equ 0040h

// Register: PSTR2CON
#define PSTR2CON PSTR2CON
PSTR2CON                                 equ 0FB9h
// bitfield definitions
PSTR2CON_STRA_POSN                       equ 0000h
PSTR2CON_STRA_POSITION                   equ 0000h
PSTR2CON_STRA_SIZE                       equ 0001h
PSTR2CON_STRA_LENGTH                     equ 0001h
PSTR2CON_STRA_MASK                       equ 0001h
PSTR2CON_STRB_POSN                       equ 0001h
PSTR2CON_STRB_POSITION                   equ 0001h
PSTR2CON_STRB_SIZE                       equ 0001h
PSTR2CON_STRB_LENGTH                     equ 0001h
PSTR2CON_STRB_MASK                       equ 0002h
PSTR2CON_STRC_POSN                       equ 0002h
PSTR2CON_STRC_POSITION                   equ 0002h
PSTR2CON_STRC_SIZE                       equ 0001h
PSTR2CON_STRC_LENGTH                     equ 0001h
PSTR2CON_STRC_MASK                       equ 0004h
PSTR2CON_STRD_POSN                       equ 0003h
PSTR2CON_STRD_POSITION                   equ 0003h
PSTR2CON_STRD_SIZE                       equ 0001h
PSTR2CON_STRD_LENGTH                     equ 0001h
PSTR2CON_STRD_MASK                       equ 0008h
PSTR2CON_STRSYNC_POSN                    equ 0004h
PSTR2CON_STRSYNC_POSITION                equ 0004h
PSTR2CON_STRSYNC_SIZE                    equ 0001h
PSTR2CON_STRSYNC_LENGTH                  equ 0001h
PSTR2CON_STRSYNC_MASK                    equ 0010h
PSTR2CON_CMPL0_POSN                      equ 0006h
PSTR2CON_CMPL0_POSITION                  equ 0006h
PSTR2CON_CMPL0_SIZE                      equ 0001h
PSTR2CON_CMPL0_LENGTH                    equ 0001h
PSTR2CON_CMPL0_MASK                      equ 0040h
PSTR2CON_CMPL1_POSN                      equ 0007h
PSTR2CON_CMPL1_POSITION                  equ 0007h
PSTR2CON_CMPL1_SIZE                      equ 0001h
PSTR2CON_CMPL1_LENGTH                    equ 0001h
PSTR2CON_CMPL1_MASK                      equ 0080h
PSTR2CON_P2DC0_POSN                      equ 0000h
PSTR2CON_P2DC0_POSITION                  equ 0000h
PSTR2CON_P2DC0_SIZE                      equ 0001h
PSTR2CON_P2DC0_LENGTH                    equ 0001h
PSTR2CON_P2DC0_MASK                      equ 0001h
PSTR2CON_P2DC1_POSN                      equ 0001h
PSTR2CON_P2DC1_POSITION                  equ 0001h
PSTR2CON_P2DC1_SIZE                      equ 0001h
PSTR2CON_P2DC1_LENGTH                    equ 0001h
PSTR2CON_P2DC1_MASK                      equ 0002h
PSTR2CON_P2DC2_POSN                      equ 0002h
PSTR2CON_P2DC2_POSITION                  equ 0002h
PSTR2CON_P2DC2_SIZE                      equ 0001h
PSTR2CON_P2DC2_LENGTH                    equ 0001h
PSTR2CON_P2DC2_MASK                      equ 0004h
PSTR2CON_P2DC3_POSN                      equ 0003h
PSTR2CON_P2DC3_POSITION                  equ 0003h
PSTR2CON_P2DC3_SIZE                      equ 0001h
PSTR2CON_P2DC3_LENGTH                    equ 0001h
PSTR2CON_P2DC3_MASK                      equ 0008h
PSTR2CON_P2DC4_POSN                      equ 0004h
PSTR2CON_P2DC4_POSITION                  equ 0004h
PSTR2CON_P2DC4_SIZE                      equ 0001h
PSTR2CON_P2DC4_LENGTH                    equ 0001h
PSTR2CON_P2DC4_MASK                      equ 0010h
PSTR2CON_P2DC5_POSN                      equ 0005h
PSTR2CON_P2DC5_POSITION                  equ 0005h
PSTR2CON_P2DC5_SIZE                      equ 0001h
PSTR2CON_P2DC5_LENGTH                    equ 0001h
PSTR2CON_P2DC5_MASK                      equ 0020h
PSTR2CON_P2DC6_POSN                      equ 0006h
PSTR2CON_P2DC6_POSITION                  equ 0006h
PSTR2CON_P2DC6_SIZE                      equ 0001h
PSTR2CON_P2DC6_LENGTH                    equ 0001h
PSTR2CON_P2DC6_MASK                      equ 0040h
PSTR2CON_P2DC02_POSN                     equ 0000h
PSTR2CON_P2DC02_POSITION                 equ 0000h
PSTR2CON_P2DC02_SIZE                     equ 0001h
PSTR2CON_P2DC02_LENGTH                   equ 0001h
PSTR2CON_P2DC02_MASK                     equ 0001h
PSTR2CON_P2DC12_POSN                     equ 0001h
PSTR2CON_P2DC12_POSITION                 equ 0001h
PSTR2CON_P2DC12_SIZE                     equ 0001h
PSTR2CON_P2DC12_LENGTH                   equ 0001h
PSTR2CON_P2DC12_MASK                     equ 0002h
PSTR2CON_P2DC22_POSN                     equ 0002h
PSTR2CON_P2DC22_POSITION                 equ 0002h
PSTR2CON_P2DC22_SIZE                     equ 0001h
PSTR2CON_P2DC22_LENGTH                   equ 0001h
PSTR2CON_P2DC22_MASK                     equ 0004h
PSTR2CON_P2DC32_POSN                     equ 0003h
PSTR2CON_P2DC32_POSITION                 equ 0003h
PSTR2CON_P2DC32_SIZE                     equ 0001h
PSTR2CON_P2DC32_LENGTH                   equ 0001h
PSTR2CON_P2DC32_MASK                     equ 0008h
PSTR2CON_P2DC42_POSN                     equ 0004h
PSTR2CON_P2DC42_POSITION                 equ 0004h
PSTR2CON_P2DC42_SIZE                     equ 0001h
PSTR2CON_P2DC42_LENGTH                   equ 0001h
PSTR2CON_P2DC42_MASK                     equ 0010h
PSTR2CON_P2DC52_POSN                     equ 0005h
PSTR2CON_P2DC52_POSITION                 equ 0005h
PSTR2CON_P2DC52_SIZE                     equ 0001h
PSTR2CON_P2DC52_LENGTH                   equ 0001h
PSTR2CON_P2DC52_MASK                     equ 0020h
PSTR2CON_P2DC62_POSN                     equ 0006h
PSTR2CON_P2DC62_POSITION                 equ 0006h
PSTR2CON_P2DC62_SIZE                     equ 0001h
PSTR2CON_P2DC62_LENGTH                   equ 0001h
PSTR2CON_P2DC62_MASK                     equ 0040h
PSTR2CON_P2DC0CON_POSN                   equ 0000h
PSTR2CON_P2DC0CON_POSITION               equ 0000h
PSTR2CON_P2DC0CON_SIZE                   equ 0001h
PSTR2CON_P2DC0CON_LENGTH                 equ 0001h
PSTR2CON_P2DC0CON_MASK                   equ 0001h
PSTR2CON_P2DC1CON_POSN                   equ 0001h
PSTR2CON_P2DC1CON_POSITION               equ 0001h
PSTR2CON_P2DC1CON_SIZE                   equ 0001h
PSTR2CON_P2DC1CON_LENGTH                 equ 0001h
PSTR2CON_P2DC1CON_MASK                   equ 0002h
PSTR2CON_P2DC2CON_POSN                   equ 0002h
PSTR2CON_P2DC2CON_POSITION               equ 0002h
PSTR2CON_P2DC2CON_SIZE                   equ 0001h
PSTR2CON_P2DC2CON_LENGTH                 equ 0001h
PSTR2CON_P2DC2CON_MASK                   equ 0004h
PSTR2CON_P2DC3CON_POSN                   equ 0003h
PSTR2CON_P2DC3CON_POSITION               equ 0003h
PSTR2CON_P2DC3CON_SIZE                   equ 0001h
PSTR2CON_P2DC3CON_LENGTH                 equ 0001h
PSTR2CON_P2DC3CON_MASK                   equ 0008h
PSTR2CON_P2DC4CON_POSN                   equ 0004h
PSTR2CON_P2DC4CON_POSITION               equ 0004h
PSTR2CON_P2DC4CON_SIZE                   equ 0001h
PSTR2CON_P2DC4CON_LENGTH                 equ 0001h
PSTR2CON_P2DC4CON_MASK                   equ 0010h
PSTR2CON_CMPL02_POSN                     equ 0006h
PSTR2CON_CMPL02_POSITION                 equ 0006h
PSTR2CON_CMPL02_SIZE                     equ 0001h
PSTR2CON_CMPL02_LENGTH                   equ 0001h
PSTR2CON_CMPL02_MASK                     equ 0040h
PSTR2CON_CMPL12_POSN                     equ 0007h
PSTR2CON_CMPL12_POSITION                 equ 0007h
PSTR2CON_CMPL12_SIZE                     equ 0001h
PSTR2CON_CMPL12_LENGTH                   equ 0001h
PSTR2CON_CMPL12_MASK                     equ 0080h
PSTR2CON_STRA2_POSN                      equ 0000h
PSTR2CON_STRA2_POSITION                  equ 0000h
PSTR2CON_STRA2_SIZE                      equ 0001h
PSTR2CON_STRA2_LENGTH                    equ 0001h
PSTR2CON_STRA2_MASK                      equ 0001h
PSTR2CON_STRB2_POSN                      equ 0001h
PSTR2CON_STRB2_POSITION                  equ 0001h
PSTR2CON_STRB2_SIZE                      equ 0001h
PSTR2CON_STRB2_LENGTH                    equ 0001h
PSTR2CON_STRB2_MASK                      equ 0002h
PSTR2CON_STRC2_POSN                      equ 0002h
PSTR2CON_STRC2_POSITION                  equ 0002h
PSTR2CON_STRC2_SIZE                      equ 0001h
PSTR2CON_STRC2_LENGTH                    equ 0001h
PSTR2CON_STRC2_MASK                      equ 0004h
PSTR2CON_STRD2_POSN                      equ 0003h
PSTR2CON_STRD2_POSITION                  equ 0003h
PSTR2CON_STRD2_SIZE                      equ 0001h
PSTR2CON_STRD2_LENGTH                    equ 0001h
PSTR2CON_STRD2_MASK                      equ 0008h
PSTR2CON_STRSYNC2_POSN                   equ 0004h
PSTR2CON_STRSYNC2_POSITION               equ 0004h
PSTR2CON_STRSYNC2_SIZE                   equ 0001h
PSTR2CON_STRSYNC2_LENGTH                 equ 0001h
PSTR2CON_STRSYNC2_MASK                   equ 0010h
PSTR2CON_P2DC6CON_POSN                   equ 0006h
PSTR2CON_P2DC6CON_POSITION               equ 0006h
PSTR2CON_P2DC6CON_SIZE                   equ 0001h
PSTR2CON_P2DC6CON_LENGTH                 equ 0001h
PSTR2CON_P2DC6CON_MASK                   equ 0040h
PSTR2CON_P2DC5CON_POSN                   equ 0005h
PSTR2CON_P2DC5CON_POSITION               equ 0005h
PSTR2CON_P2DC5CON_SIZE                   equ 0001h
PSTR2CON_P2DC5CON_LENGTH                 equ 0001h
PSTR2CON_P2DC5CON_MASK                   equ 0020h

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 0FBAh
// bitfield definitions
CCP1CON_CCP1M_POSN                       equ 0000h
CCP1CON_CCP1M_POSITION                   equ 0000h
CCP1CON_CCP1M_SIZE                       equ 0004h
CCP1CON_CCP1M_LENGTH                     equ 0004h
CCP1CON_CCP1M_MASK                       equ 000Fh
CCP1CON_DC1B_POSN                        equ 0004h
CCP1CON_DC1B_POSITION                    equ 0004h
CCP1CON_DC1B_SIZE                        equ 0002h
CCP1CON_DC1B_LENGTH                      equ 0002h
CCP1CON_DC1B_MASK                        equ 0030h
CCP1CON_P1M_POSN                         equ 0006h
CCP1CON_P1M_POSITION                     equ 0006h
CCP1CON_P1M_SIZE                         equ 0002h
CCP1CON_P1M_LENGTH                       equ 0002h
CCP1CON_P1M_MASK                         equ 00C0h
CCP1CON_CCP1M0_POSN                      equ 0000h
CCP1CON_CCP1M0_POSITION                  equ 0000h
CCP1CON_CCP1M0_SIZE                      equ 0001h
CCP1CON_CCP1M0_LENGTH                    equ 0001h
CCP1CON_CCP1M0_MASK                      equ 0001h
CCP1CON_CCP1M1_POSN                      equ 0001h
CCP1CON_CCP1M1_POSITION                  equ 0001h
CCP1CON_CCP1M1_SIZE                      equ 0001h
CCP1CON_CCP1M1_LENGTH                    equ 0001h
CCP1CON_CCP1M1_MASK                      equ 0002h
CCP1CON_CCP1M2_POSN                      equ 0002h
CCP1CON_CCP1M2_POSITION                  equ 0002h
CCP1CON_CCP1M2_SIZE                      equ 0001h
CCP1CON_CCP1M2_LENGTH                    equ 0001h
CCP1CON_CCP1M2_MASK                      equ 0004h
CCP1CON_CCP1M3_POSN                      equ 0003h
CCP1CON_CCP1M3_POSITION                  equ 0003h
CCP1CON_CCP1M3_SIZE                      equ 0001h
CCP1CON_CCP1M3_LENGTH                    equ 0001h
CCP1CON_CCP1M3_MASK                      equ 0008h
CCP1CON_DC1B0_POSN                       equ 0004h
CCP1CON_DC1B0_POSITION                   equ 0004h
CCP1CON_DC1B0_SIZE                       equ 0001h
CCP1CON_DC1B0_LENGTH                     equ 0001h
CCP1CON_DC1B0_MASK                       equ 0010h
CCP1CON_DC1B1_POSN                       equ 0005h
CCP1CON_DC1B1_POSITION                   equ 0005h
CCP1CON_DC1B1_SIZE                       equ 0001h
CCP1CON_DC1B1_LENGTH                     equ 0001h
CCP1CON_DC1B1_MASK                       equ 0020h
CCP1CON_P1M0_POSN                        equ 0006h
CCP1CON_P1M0_POSITION                    equ 0006h
CCP1CON_P1M0_SIZE                        equ 0001h
CCP1CON_P1M0_LENGTH                      equ 0001h
CCP1CON_P1M0_MASK                        equ 0040h
CCP1CON_P1M1_POSN                        equ 0007h
CCP1CON_P1M1_POSITION                    equ 0007h
CCP1CON_P1M1_SIZE                        equ 0001h
CCP1CON_P1M1_LENGTH                      equ 0001h
CCP1CON_P1M1_MASK                        equ 0080h
CCP1CON_CCP1Y_POSN                       equ 0004h
CCP1CON_CCP1Y_POSITION                   equ 0004h
CCP1CON_CCP1Y_SIZE                       equ 0001h
CCP1CON_CCP1Y_LENGTH                     equ 0001h
CCP1CON_CCP1Y_MASK                       equ 0010h
CCP1CON_CCP1X_POSN                       equ 0005h
CCP1CON_CCP1X_POSITION                   equ 0005h
CCP1CON_CCP1X_SIZE                       equ 0001h
CCP1CON_CCP1X_LENGTH                     equ 0001h
CCP1CON_CCP1X_MASK                       equ 0020h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 0FBBh

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0FBBh
// bitfield definitions
CCPR1L_CCPR1L_POSN                       equ 0000h
CCPR1L_CCPR1L_POSITION                   equ 0000h
CCPR1L_CCPR1L_SIZE                       equ 0008h
CCPR1L_CCPR1L_LENGTH                     equ 0008h
CCPR1L_CCPR1L_MASK                       equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0FBCh
// bitfield definitions
CCPR1H_CCPR1H_POSN                       equ 0000h
CCPR1H_CCPR1H_POSITION                   equ 0000h
CCPR1H_CCPR1H_SIZE                       equ 0008h
CCPR1H_CCPR1H_LENGTH                     equ 0008h
CCPR1H_CCPR1H_MASK                       equ 00FFh

// Register: ECCP1DEL
#define ECCP1DEL ECCP1DEL
ECCP1DEL                                 equ 0FBDh
// bitfield definitions
ECCP1DEL_P1DC_POSN                       equ 0000h
ECCP1DEL_P1DC_POSITION                   equ 0000h
ECCP1DEL_P1DC_SIZE                       equ 0007h
ECCP1DEL_P1DC_LENGTH                     equ 0007h
ECCP1DEL_P1DC_MASK                       equ 007Fh
ECCP1DEL_P1RSEN_POSN                     equ 0007h
ECCP1DEL_P1RSEN_POSITION                 equ 0007h
ECCP1DEL_P1RSEN_SIZE                     equ 0001h
ECCP1DEL_P1RSEN_LENGTH                   equ 0001h
ECCP1DEL_P1RSEN_MASK                     equ 0080h
ECCP1DEL_P1DC0_POSN                      equ 0000h
ECCP1DEL_P1DC0_POSITION                  equ 0000h
ECCP1DEL_P1DC0_SIZE                      equ 0001h
ECCP1DEL_P1DC0_LENGTH                    equ 0001h
ECCP1DEL_P1DC0_MASK                      equ 0001h
ECCP1DEL_P1DC1_POSN                      equ 0001h
ECCP1DEL_P1DC1_POSITION                  equ 0001h
ECCP1DEL_P1DC1_SIZE                      equ 0001h
ECCP1DEL_P1DC1_LENGTH                    equ 0001h
ECCP1DEL_P1DC1_MASK                      equ 0002h
ECCP1DEL_P1DC2_POSN                      equ 0002h
ECCP1DEL_P1DC2_POSITION                  equ 0002h
ECCP1DEL_P1DC2_SIZE                      equ 0001h
ECCP1DEL_P1DC2_LENGTH                    equ 0001h
ECCP1DEL_P1DC2_MASK                      equ 0004h
ECCP1DEL_P1DC3_POSN                      equ 0003h
ECCP1DEL_P1DC3_POSITION                  equ 0003h
ECCP1DEL_P1DC3_SIZE                      equ 0001h
ECCP1DEL_P1DC3_LENGTH                    equ 0001h
ECCP1DEL_P1DC3_MASK                      equ 0008h
ECCP1DEL_P1DC4_POSN                      equ 0004h
ECCP1DEL_P1DC4_POSITION                  equ 0004h
ECCP1DEL_P1DC4_SIZE                      equ 0001h
ECCP1DEL_P1DC4_LENGTH                    equ 0001h
ECCP1DEL_P1DC4_MASK                      equ 0010h
ECCP1DEL_P1DC5_POSN                      equ 0005h
ECCP1DEL_P1DC5_POSITION                  equ 0005h
ECCP1DEL_P1DC5_SIZE                      equ 0001h
ECCP1DEL_P1DC5_LENGTH                    equ 0001h
ECCP1DEL_P1DC5_MASK                      equ 0020h
ECCP1DEL_P1DC6_POSN                      equ 0006h
ECCP1DEL_P1DC6_POSITION                  equ 0006h
ECCP1DEL_P1DC6_SIZE                      equ 0001h
ECCP1DEL_P1DC6_LENGTH                    equ 0001h
ECCP1DEL_P1DC6_MASK                      equ 0040h

